eecs373-w26-telescope/telescope-nucleo/stm32f4/Core/Src/controller.cpp
/*

State machine implementation
- INIT
- READY
- SEARCH
- FOUND

*/

#include <hw/inc/encoder.hpp>
#include <hw/inc/filter.hpp>
#include <hw/inc/gps.hpp>
#include <hw/inc/imu.hpp>
#include <hw/inc/raspi.hpp>
#include <hw/inc/sd_card.hpp>
#include <hw/inc/touch.hpp>
#include <hw/inc/touchscreen.hpp>
#include <astro/inc/state_machine.h>
#include <astro/inc/astronomy.hpp>

#include "main.h"
#include "stm32f4xx.h"
#include "stm32f4xx_hal_uart.h"
#include <algorithm>
#include <cmath>
#include <cstdio>
#include <ctime>

// __DATE__ = "Mmm DD YYYY", __TIME__ = "HH:MM:SS"
namespace build_time {
    constexpr int d(char c) { return c - '0'; }
    constexpr int month() {
        const char* s = __DATE__;
        if (s[0]=='J' && s[1]=='a') return 1;
        if (s[0]=='F') return 2;
        if (s[0]=='M' && s[2]=='r') return 3;
        if (s[0]=='A' && s[1]=='p') return 4;
        if (s[0]=='M') return 5;
        if (s[0]=='J' && s[2]=='n') return 6;
        if (s[0]=='J') return 7;
        if (s[0]=='A') return 8;
        if (s[0]=='S') return 9;
        if (s[0]=='O') return 10;
        if (s[0]=='N') return 11;
        return 12;
    }
    constexpr int day()    { return (__DATE__[4]==' ' ? 0 : d(__DATE__[4]))*10 + d(__DATE__[5]); }
    constexpr int year()   { return d(__DATE__[7])*1000 + d(__DATE__[8])*100 + d(__DATE__[9])*10 + d(__DATE__[10]); }
    constexpr int hour()   { return d(__TIME__[0])*10 + d(__TIME__[1]); }
    constexpr int minute() { return d(__TIME__[3])*10 + d(__TIME__[4]); }
    constexpr int second() { return d(__TIME__[6])*10 + d(__TIME__[7]); }
}

extern "C" UART_HandleTypeDef huart1;
extern "C" UART_HandleTypeDef huart3;
extern "C" UART_HandleTypeDef huart6;
extern "C" I2C_HandleTypeDef hi2c1;
extern "C" SPI_HandleTypeDef hspi1;

namespace telescope {

    /***********************
    PORTS & PINS
    ************************/
    #define ENCODER_YAW_CS_PORT   GPIOC
    #define ENCODER_YAW_CS_PIN    GPIO_PIN_2  // D12 (PC2)
    #define ENCODER_PITCH_CS_PORT GPIOC
    #define ENCODER_PITCH_CS_PIN  GPIO_PIN_1  // D13 (PC1)

    #define LCD_CS_PORT   GPIOA
    #define LCD_CS_PIN    GPIO_PIN_4   // A0
    #define LCD_RST_PORT  GPIOC
    #define LCD_RST_PIN   GPIO_PIN_5   // A5
    #define LCD_DC_PORT   GPIOB
    #define LCD_DC_PIN    GPIO_PIN_13  // SCK
    #define LCD_LED_PORT  GPIOB
    #define LCD_LED_PIN   GPIO_PIN_15  // MOSI

    #define TOUCH_CS_PORT  GPIOC
    #define TOUCH_CS_PIN   GPIO_PIN_3   // D11
    #define TOUCH_IRQ_PORT GPIOB
    #define TOUCH_IRQ_PIN  GPIO_PIN_14  // MISO

    #define DEBUG_BUTTON_PORT GPIOC
    #define DEBUG_BUTTON_PIN  GPIO_PIN_4

    /***********************
    OFFSETS & FILTERS
    ************************/
    constexpr uint16_t ENCODER_FULL = 16384;
    constexpr uint16_t deg_to_raw(float deg) {
        return static_cast<uint16_t>((deg / 360.0f) * ENCODER_FULL) % ENCODER_FULL;
    }

    // OFFSET HEADING HERE
    constexpr uint16_t YAW_OFFSET   = deg_to_raw(30.5f);
    constexpr uint16_t PITCH_OFFSET = deg_to_raw(116.6f);

    // BNO055 heading: int16_t units of 1/16 deg, full circle = 360 * 16 = 5760
    // AS5048A raw: uint16_t 14-bit, full circle = 16384
    constexpr std::size_t FILTER_WINDOW = 8;
    filter::Filter<int16_t,  FILTER_WINDOW> imu_filter{5760};
    filter::Filter<uint16_t, FILTER_WINDOW> yaw_filter{16384};
    filter::Filter<uint16_t, FILTER_WINDOW> pitch_filter{16384};

    /***********************
    HARDWARE INITIALIZATION
    ************************/
    Encoder yaw_encoder(&hspi1, ENCODER_YAW_CS_PORT, ENCODER_YAW_CS_PIN, YAW_OFFSET);
    Encoder pitch_encoder(&hspi1, ENCODER_PITCH_CS_PORT, ENCODER_PITCH_CS_PIN, PITCH_OFFSET);

    GPS gps(&huart6);
    IMU imu(&hi2c1);
    RasPi raspi(&huart1);
    SDCard sd_card{};

    Touchscreen touchscreen(&hspi1,
        LCD_CS_PORT,  LCD_CS_PIN,
        LCD_RST_PORT, LCD_RST_PIN,
        LCD_LED_PORT, LCD_LED_PIN,
        LCD_DC_PORT,  LCD_DC_PIN);  // cs, rst, led, dc
    Touch xpt(&hspi1, TOUCH_CS_PORT, TOUCH_CS_PIN, TOUCH_IRQ_PORT, TOUCH_IRQ_PIN);


    /***********************
    TIMING
    ************************/
    constexpr uint32_t hz_to_ms(uint32_t hz) { return 1000u / hz; }

    constexpr uint32_t IMU_HZ           = 10;
    constexpr uint32_t GPS_HZ           = 1;
    constexpr uint32_t ENCODER_HZ       = 10;
    constexpr uint32_t SERIAL_DEBUG_HZ  = 5;
    constexpr uint32_t STATE_MACHINE_HZ = 10;
    constexpr uint32_t AZ_DEBUG_HZ      = 5;
    constexpr uint32_t ASTRO_DEBUG_HZ   = 5;
    constexpr uint32_t SG_DEBUG_HZ      = 5;

    constexpr uint32_t IMU_INTERVAL_MS           = hz_to_ms(IMU_HZ);
    constexpr uint32_t GPS_INTERVAL_MS           = hz_to_ms(GPS_HZ);
    constexpr uint32_t ENCODER_INTERVAL_MS       = hz_to_ms(ENCODER_HZ);
    constexpr uint32_t SERIAL_INTERVAL_MS        = hz_to_ms(SERIAL_DEBUG_HZ);
    constexpr uint32_t TOUCH_DEBOUNCE_MS         = 500;
    constexpr uint32_t STATE_MACHINE_INTERVAL_MS = hz_to_ms(STATE_MACHINE_HZ);
    constexpr uint32_t AZ_DEBUG_INTERVAL_MS      = hz_to_ms(AZ_DEBUG_HZ);
    constexpr uint32_t ASTRO_DEBUG_INTERVAL_MS   = hz_to_ms(ASTRO_DEBUG_HZ);
    constexpr uint32_t SG_DEBUG_INTERVAL_MS      = hz_to_ms(SG_DEBUG_HZ);

    float filtered_imu_heading_deg = 0.0f;
    uint16_t filtered_yaw_raw   = 0;
    uint16_t filtered_pitch_raw = 0;
    uint32_t last_imu_tick = 0;
    uint32_t last_gps_tick = 0;
    uint32_t last_ping_tick = 0;
    uint32_t last_encoder_tick = 0;
    uint32_t last_serial_tick = 0;
    uint32_t last_touch_tick = 0;
    uint32_t last_sm_tick = 0;
    uint32_t last_az_debug_tick = 0;
    uint32_t last_astro_debug_tick = 0;
    uint32_t last_sg_debug_tick = 0;

    /***********************
    STATE MACHINE
    ************************/
    StateMachine state_machine(touchscreen, sd_card, raspi);

    auto init() -> void {
        const char* msg = "telescope init\r\n";
        HAL_UART_Transmit(&huart3, reinterpret_cast<const uint8_t*>(msg), 16, 100);

        raspi.init();

        imu.init();
        {
            char imu_buf[48];
            int imu_len = snprintf(imu_buf, sizeof(imu_buf), "IMU calib: %s\r\n", imu.calibration_loaded() ? "loaded from flash" : "none (fresh boot)");
            HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(imu_buf), static_cast<uint16_t>(imu_len), 100);
        }
        gps.init();

        yaw_encoder.clear_error();
        pitch_encoder.clear_error();

