eecs373-w26-telescope/telescope-nucleo/stm32f4/Core/Src/controller.cpp
        touchscreen.init();
        touchscreen.draw_main();

        xpt.init(); 
        //TODO: ADD ANYTHING ELSE TO INITIALIZE THE TOUCH SCREEN HERE

        int mount_res = sd_card.mount();
        int open_res  = sd_card.open_catalogue("0:catalogue.bin");
        char sd_buf[64];
        int sd_len = snprintf(sd_buf, sizeof(sd_buf), "SD mount:%d open:%d fopen_err:%d\r\n",
                              mount_res, open_res, sd_card.last_open_error());
        HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(sd_buf), static_cast<uint16_t>(sd_len), 100);

        char time_buf[64];
        int time_len = snprintf(time_buf, sizeof(time_buf),
                                "Fallback time: %04d-%02d-%02d %02d:%02d:%02d\r\n",
                                build_time::year(), build_time::month(), build_time::day(),
                                build_time::hour(), build_time::minute(), build_time::second());
        HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(time_buf), static_cast<uint16_t>(time_len), 100);

        if (open_res == 0) {
            std::vector<DSO> all_objects;
            sd_card.search_objects_in_bounds(0.0f, 359.99f, -90.0f, 90.0f, all_objects);
            char hdr[32];
            int hdr_len = snprintf(hdr, sizeof(hdr), "DSO dump: %d objects\r\n", static_cast<int>(all_objects.size()));
            HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(hdr), static_cast<uint16_t>(hdr_len), 100);
            for (const auto& obj : all_objects) {
                char obj_buf[64];
                int obj_len = snprintf(obj_buf, sizeof(obj_buf), "  %s RA=%.2f DEC=%.2f mag=%.1f\r\n",
                                       obj.name.c_str(),
                                       static_cast<double>(obj.pos.right_ascension),
                                       static_cast<double>(obj.pos.declination),
                                       static_cast<double>(obj.brightness));
                HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(obj_buf), static_cast<uint16_t>(obj_len), 100);
            }
        }

        state_machine.init();
    }

    //TODO: MOVE THIS ELSEWHERE
    bool prev_button_pressed = false;

    [[noreturn]] auto loop() -> void {
        for (;;) {
            // Send periodic sensor updates to the raspi
            raspi.process();
            gps.process();

            uint32_t now = HAL_GetTick();

            if (now - last_imu_tick >= IMU_INTERVAL_MS) {
                last_imu_tick = now;
                if (imu.update()) {
                    IMUPayload payload{};
                    payload.heading = imu_filter.update(imu.get_heading());
                    payload.calibration = imu.get_calibration();
                    filtered_imu_heading_deg = static_cast<float>(payload.heading) / 16.0f;
                    raspi.send_imu(payload);

                    static bool calib_saved = false;
                    static uint8_t mag_stable_count = 0;
                    if (!calib_saved) {
                        if ((payload.calibration & 0x03) == 0x03) {
                            if (++mag_stable_count >= 10) {
                                calib_saved = imu.save_calibration();
                            }
                        } else {
                            mag_stable_count = 0;
                        }
                    }
                }
            }

            if (now - last_gps_tick >= GPS_INTERVAL_MS) {
                last_gps_tick = now;
                if (gps.has_fix()) {
                    raspi.send_gps(gps.payload());
                }
            }

            if (now - last_encoder_tick >= ENCODER_INTERVAL_MS) {
                last_encoder_tick = now;
                EncoderPayload payload{};
                uint16_t raw = 0;
                bool yaw_ok = (yaw_encoder.read_raw_angle(raw, true) == HAL_OK);
                if (yaw_ok) {
                    filtered_yaw_raw = yaw_filter.update(raw);
                    payload.yaw_raw = filtered_yaw_raw;
                }
                bool pitch_ok = (pitch_encoder.read_raw_angle(raw) == HAL_OK);
                if (pitch_ok) {
                    filtered_pitch_raw = pitch_filter.update(raw);
                    payload.pitch_raw = filtered_pitch_raw;
                }
                if (yaw_ok || pitch_ok) raspi.send_encoder(payload);
            }

            if (now - last_serial_tick >= SERIAL_INTERVAL_MS) {
                last_serial_tick = now;
                bool imu_ok = imu.update();
                uint8_t cal = imu.get_calibration();
                constexpr float RAW_TO_DEG_DBG = 360.0f / 16384.0f;
                float yaw_deg = filtered_yaw_raw   * RAW_TO_DEG_DBG;
                float pitch_deg = filtered_pitch_raw * RAW_TO_DEG_DBG;
                char buf[120];
                int len = snprintf(buf, sizeof(buf),
                                   "IMU: %s  HDG: %.1f  CAL: S%d G%d A%d M%d  GPS: %s  SAT: %d  YAW: %.1f  PIT: %.1f\r\n",
                                   imu_ok ? "OK" : "FAIL",
                                   filtered_imu_heading_deg,
                                   (cal >> 6) & 3, (cal >> 4) & 3,
                                   (cal >> 2) & 3, cal & 3,
                                   gps.has_fix() ? "FIX" : "---",
                                   gps.num_satellites,
                                   static_cast<double>(yaw_deg),
                                   static_cast<double>(pitch_deg));
                HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(buf),
                                  static_cast<uint16_t>(len), 100);

                EquatorialCoordinates eqc = state_machine.current_eqc();
                char sm_buf[120];
                int sm_len = snprintf(sm_buf, sizeof(sm_buf),
                                      "SM: state=%d target=M%d found=%d fov_objs=%d search_res=%d RA=%.2f DEC=%.2f%s\r\n",
                                      static_cast<int>(state_machine.current_state()),
                                      state_machine.selected_messier_id(),
                                      state_machine.has_selected_object() ? 1 : 0,
                                      state_machine.fov_object_count(),
                                      state_machine.last_search_result(),
                                      static_cast<double>(eqc.right_ascension),
                                      static_cast<double>(eqc.declination),
                                      gps.has_fix() ? "" : (raspi.has_raspi_time() ? " [RASPI-TIME]" : " [BUILD-TIME]"));
                HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(sm_buf),
                                  static_cast<uint16_t>(sm_len), 100);

                const FOV& fov = state_machine.current_fov();
                char fov_buf[80];
                int fov_len = snprintf(fov_buf, sizeof(fov_buf),
                                       "FOV: center=%.2fh/%.2fd r=%.2fd objects=%d\r\n",
                                       static_cast<double>(fov.center_pos.right_ascension),
                                       static_cast<double>(fov.center_pos.declination),
                                       static_cast<double>(fov.radius),
                                       static_cast<int>(fov.objects.size()));
                HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(fov_buf), static_cast<uint16_t>(fov_len), 100);

                for (const auto& obj : fov.objects) {
                    char obj_buf[64];
                    int obj_len = snprintf(obj_buf, sizeof(obj_buf), "  %s RA=%.2f DEC=%.2f mag=%.1f\r\n",
                                          obj.name.c_str(),
                                          static_cast<double>(obj.pos.right_ascension),
                                          static_cast<double>(obj.pos.declination),
                                          static_cast<double>(obj.brightness));
                    HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(obj_buf), static_cast<uint16_t>(obj_len), 100);
                }

                StateSyncPayload sync{};
                sync.state    = static_cast<uint8_t>(state_machine.current_state());
                sync.flags    = 0;
                sync.sequence = 0;
                raspi.send_state_sync(sync);
            }

            // Touchscreen input processing
            if(xpt.is_pressed() && (now - last_touch_tick >= TOUCH_DEBOUNCE_MS)){
                last_touch_tick = now;
                if(xpt.process()){
                    char btn = xpt.get_button();
                    char action = touchscreen.update_display_string(btn);
                    if(touchscreen.get_search_status()){
                        if(action == 'C'){
                            touchscreen.gocancel();
                        }
                    }
                    else{
                        if(action == 'V'){
                            touchscreen.view_change();
                        }
                        else{
                            touchscreen.normal_process(action, btn);
                        }
                    }
                }
            }

            // State machine tick
            //TODO: I DONT THINK THIS STATE_MACHINE_INTERVAL IS NECESSARY
            if (now - last_sm_tick >= STATE_MACHINE_INTERVAL_MS) {
                last_sm_tick = now;
                constexpr float RAW_TO_DEG = 360.0f / 16384.0f;
                float yaw_deg_sm   = filtered_yaw_raw   * RAW_TO_DEG;
                float pitch_deg_sm = filtered_pitch_raw * RAW_TO_DEG;
                float azimuth_deg = std::fmod(filtered_imu_heading_deg + yaw_deg_sm + 360.0f, 360.0f);

                constexpr float FALLBACK_LAT = 42.29243326092064f;
                constexpr float FALLBACK_LON = -83.71498310538729f;
                float lat = gps.has_fix() ? static_cast<float>(gps.latitude)  : FALLBACK_LAT;
                float lon = gps.has_fix() ? static_cast<float>(gps.longitude) : FALLBACK_LON;
                UTC time{};
                if (gps.has_fix()) {
                    time.year   = gps.year;
                    time.month  = gps.month;
                    time.day    = gps.day;
                    time.hour   = gps.utc_hours;
                    time.minute = gps.utc_minutes;
                    time.second = static_cast<int>(gps.utc_seconds);
                } else if (raspi.has_raspi_time()) {
                    time = raspi.raspi_time();
                } else {
                    time.year   = build_time::year();
                    time.month  = build_time::month();
                    time.day    = build_time::day();
                    time.hour   = build_time::hour();
                    time.minute = build_time::minute();
                    time.second = build_time::second();
                }

                {
                    TimeModePayload tm{};
                    if (gps.has_fix())               tm.mode = TIME_MODE_SATELLITE;
                    else if (raspi.has_raspi_time()) tm.mode = TIME_MODE_RASPI;
                    else                             tm.mode = TIME_MODE_COMPILE;
                    raspi.send_time_mode(tm);
                }

                state_machine.update_sensors(pitch_deg_sm, azimuth_deg, lat, lon, time);
                state_machine.tick();

                if (state_machine.selected_messier_id() >= 0) {
                    state_machine.send_dso_target_packet();
                }

                {
                    const FOV& fov = state_machine.current_fov();
                    FovObjectsPayload pkt{};
                    pkt.count = 0;
                    for (const auto& obj : fov.objects) {
                        if (pkt.count >= FOV_OBJECTS_MAX) break;
                        float x = 0.0f, y = 0.0f;
                        Astronomy::project_gnomonic(fov.center_pos, obj.pos, fov.radius, x, y);
                        int id = std::stoi(obj.name.substr(1));
                        auto& e = pkt.objects[pkt.count++];
                        e.messier_id = static_cast<uint16_t>(id);
                        e.x_e4 = static_cast<int16_t>(std::clamp(x, -1.0f, 1.0f) * 10000.0f);
                        e.y_e4 = static_cast<int16_t>(std::clamp(y, -1.0f, 1.0f) * 10000.0f);
                    }
                    raspi.send_fov_objects(pkt, pkt.count);
                }

                {
                    SearchGuidancePayload sg{};
                    if (state_machine.has_selected_object()) {
                        sg.has_target = 1;
                        float raw_x = 0.0f, raw_y = 0.0f;
                        const FOV& fov = state_machine.current_fov();
                        Astronomy::project_gnomonic(
                            fov.center_pos,
                            state_machine.selected_object().pos,
                            fov.radius, raw_x, raw_y);
                        float mag = sqrtf(raw_x * raw_x + raw_y * raw_y);
                        if (mag > 1e-6f) {
                            sg.dx_e4 = static_cast<int16_t>((raw_x / mag) * 10000.0f);
                            sg.dy_e4 = static_cast<int16_t>((raw_y / mag) * 10000.0f);
                        }
                        float fov_r_rad = fov.radius * 3.14159265f / 180.0f;
                        float dist_deg  = atanf(mag * tanf(fov_r_rad)) * 180.0f / 3.14159265f;
                        sg.distance_e2  = static_cast<int16_t>(
                            std::min(dist_deg * 100.0f, 32767.0f));
                    }
                    raspi.send_search_guidance(sg);

                    if (now - last_sg_debug_tick >= SG_DEBUG_INTERVAL_MS) {
                        last_sg_debug_tick = now;
                        char sg_buf[96];
                        int sg_len = snprintf(sg_buf, sizeof(sg_buf),
                            "SG: has_tgt=%d dx=%.4f dy=%.4f dist=%.2fdeg\r\n",
                            sg.has_target,
                            sg.dx_e4 / 10000.0f,
                            sg.dy_e4 / 10000.0f,
                            sg.distance_e2 / 100.0f);
                        HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(sg_buf),
                                          static_cast<uint16_t>(sg_len), 100);
                    }
                }

                EquatorialCoordinates eqc = state_machine.current_eqc();
                HorizontalCoordinates hc = state_machine.current_hc();
                const FOV& fov = state_machine.current_fov();

                if (now - last_az_debug_tick >= AZ_DEBUG_INTERVAL_MS) {
                    last_az_debug_tick = now;
                    char az_buf[120];
                    int az_len = snprintf(az_buf, sizeof(az_buf),
                        "RAW AZ DEBUG:\r\n"
                        "  IMU HDG : %.2f deg\r\n"
                        "  YAW ENC : %.2f deg\r\n"
                        "  FINAL AZ: %.2f deg\r\n",
                        static_cast<double>(filtered_imu_heading_deg),
                        static_cast<double>(yaw_deg_sm),
                        static_cast<double>(azimuth_deg)
                    );
                    HAL_UART_Transmit(&huart3,
                        reinterpret_cast<uint8_t*>(az_buf),
                        static_cast<uint16_t>(az_len),
                        100);
                }

