eecs373-w26-telescope/telescope-nucleo/stm32f4/Core/Src/controller.cpp
                if (now - last_astro_debug_tick >= ASTRO_DEBUG_INTERVAL_MS) {
                    last_astro_debug_tick = now;
                    char astro_buf[256];
                    int astro_len = snprintf(astro_buf, sizeof(astro_buf),
                        "ASTRO:\r\n"
                        "  ALT: %.2f deg\r\n"
                        "  AZ : %.2f deg\r\n"
                        "  LAT: %.5f  LON: %.5f\r\n"
                        "  UTC: %04d-%02d-%02d %02d:%02d:%02d\r\n"
                        "  RA : %.2f hr\r\n"
                        "  DEC: %.2f deg\r\n"
                        "  FOV r: %.2f deg  objs:%d%s\r\n",
                        static_cast<double>(hc.altitude),
                        static_cast<double>(hc.azimuth),
                        static_cast<double>(lat),
                        static_cast<double>(lon),
                        time.year, time.month, time.day,
                        time.hour, time.minute, time.second,
                        static_cast<double>(eqc.right_ascension),
                        static_cast<double>(eqc.declination),
                        static_cast<double>(fov.radius),
                        static_cast<int>(fov.objects.size()),
                        gps.has_fix() ? "" : " [FALLBACK]"
                    );
                    HAL_UART_Transmit(&huart3,
                        reinterpret_cast<uint8_t*>(astro_buf),
                        static_cast<uint16_t>(astro_len),
                        100);

                    for (const auto& obj : fov.objects) {
                        char obj_buf[96];
                        int obj_len = snprintf(obj_buf, sizeof(obj_buf),
                            "  %s RA=%.2f DEC=%.2f mag=%.1f\r\n",
                            obj.name.c_str(),
                            static_cast<double>(obj.pos.right_ascension),
                            static_cast<double>(obj.pos.declination),
                            static_cast<double>(obj.brightness)
                        );
                        HAL_UART_Transmit(&huart3,
                            reinterpret_cast<uint8_t*>(obj_buf),
                            static_cast<uint16_t>(obj_len),
                            100);
                    }
                }
            }

            // Button press sends debug packet
            bool button_pressed = (HAL_GPIO_ReadPin(DEBUG_BUTTON_PORT, DEBUG_BUTTON_PIN) == GPIO_PIN_RESET);
            if (button_pressed && !prev_button_pressed) {
                DebugPayload dbg{};
                const char* msg = "PING";
                __builtin_memcpy(dbg.data, msg, 4);
                raspi.send_debug(dbg);
            }
            prev_button_pressed = button_pressed;
        }
    }

} // namespace telescope

extern "C" {

void PostInit() {
    telescope::init();
}

void Loop() {
    telescope::loop();
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        telescope::raspi.tx_complete_callback();
    }
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef* huart, uint16_t Size) {
    if (huart->Instance == USART1) {
        telescope::raspi.rx_event_callback(Size);
    }
    if (huart->Instance == USART6) {
        telescope::gps.rx_event_callback(Size);
    }
}

}
